{"id":16811,"date":"2021-04-01T16:07:32","date_gmt":"2021-04-01T20:07:32","guid":{"rendered":"http:\/\/esidesign.com\/?p=16811"},"modified":"2021-04-01T16:07:32","modified_gmt":"2021-04-01T20:07:32","slug":"installing-digital-media-installations-remotely","status":"publish","type":"post","link":"https:\/\/esidesign.nbbj.com\/installing-digital-media-installations-remotely\/","title":{"rendered":"Installing Digital Media Installations Remotely"},"content":{"rendered":"<p><img loading=\"lazy\" class=\" wp-image-13836 alignright\" src=\"http:\/\/esidesign.com\/wp-content\/uploads\/2019\/10\/2019_10_16_ESI_Matthew_Houstle_10188_RTCH_web.jpg\" alt=\"\" width=\"250\" height=\"250\" srcset=\"https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2019\/10\/2019_10_16_ESI_Matthew_Houstle_10188_RTCH_web.jpg 500w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2019\/10\/2019_10_16_ESI_Matthew_Houstle_10188_RTCH_web-150x150.jpg 150w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2019\/10\/2019_10_16_ESI_Matthew_Houstle_10188_RTCH_web-300x300.jpg 300w\" sizes=\"(max-width: 250px) 100vw, 250px\" \/>Installing digital media installations as part of epic-scale experience design activations—from exhibits in an immersive, interactive museum to an eight-story digital artwork— usually requires being on-site to make sure the software and media content is installed correctly and meets the design vision and client expectations.<\/p>\n<p>However, during the COVID-19 pandemic our multidisciplinary team adapted to almost exclusively working virtually, and this spurred innovative new design solutions. We speak to Designer and AV Technologist <strong>Matthew Houstle<\/strong> on the experiences, best practices, and lessons learned he has gleaned from the remote installs he worked on through 2020, and how installing digital media installations remotely may continue post-pandemic.<\/p>\n<h2>What is the remote install process, and how does it differ from your regular install process?<\/h2>\n<p><span style=\"font-weight: 400;\"><strong>Matthew Houstle<\/strong>: The remote install process is where we implement our media and do final punchlisting of installations of our epic-scale media installations without sending anyone from our team to the site itself. Although it is majority remote, it isn’t completely remote &#8211; we heavily use cameras installed onsite, with a combination of monitoring\/maintenance cameras and higher-quality cameras temporarily set up to aid in the installation process, all of which requires people to be there to help us facilitate this process. These feeds are also sent to our clients for reviews of the media and the entire installation.<\/span><\/p>\n<h2>Sounds very cool and high tech! What are the challenges of remote install?<\/h2>\n<p><span style=\"font-weight: 400;\"><strong>MH<\/strong>: The biggest challenge we have faced for a remote install is getting the cameras calibrated so they most closely represent what the installation looks like in-person while being viewed on a computer. This is a tedious process and requires us to work closely with our installation partners in the field, to get their input on what looks the same and what is different. We utilize multiple cameras with different features and settings so we can compare views.<\/span><\/p>\n<figure id=\"attachment_16819\" aria-describedby=\"caption-attachment-16819\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-16819 size-large\" src=\"http:\/\/esidesign.com\/wp-content\/uploads\/2021\/04\/Untitled-1-1024x381.jpg\" alt=\"\" width=\"1024\" height=\"381\" srcset=\"https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2021\/04\/Untitled-1-1024x381.jpg 1024w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2021\/04\/Untitled-1-300x112.jpg 300w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2021\/04\/Untitled-1-768x286.jpg 768w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2021\/04\/Untitled-1-1536x571.jpg 1536w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2021\/04\/Untitled-1.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption id=\"caption-attachment-16819\" class=\"wp-caption-text\">Setting up and calibrating the cameras with different views for a remote install in Chicago.<\/figcaption><\/figure>\n<p><span style=\"font-weight: 400;\">Another challenge is understanding what the client is seeing and experiencing on-site since we aren’t there with them. For example, at one installation, the client felt that the color of some lighting didn’t match the other lighting in the space. It was tough to see exactly what they meant because it was largely a feeling and their eyes are adjusting differently than our cameras. Vision is influenced by sunlight, wall colors, lighting, and more, and unfortunately, we can’t adjust our camera to account for all of that! We were able to solve this problem with the client by asking many questions as well as leveraging our partners onsite, but it was tricky in ways that wouldn’t be for a normal install process.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The other major challenge we faced was the quality of the camera streams. Different streaming services (zoom, twitch, vimeo, youtube, etc) all have different settings and priorities for color, compression, and latency which need to be balanced from a technical standpoint. The biggest misconception is educating the client rep not on site, that what they are seeing in the video stream isn’t a true representation of what it looks like in reality. We overcame some of this by sending high-quality recordings to the client (and ourselves) before and after reviews. We could then cross-reference those videos when the stream quality wasn’t allowing us to see the details we needed. <\/span><\/p>\n<figure id=\"attachment_16825\" aria-describedby=\"caption-attachment-16825\" style=\"width: 399px\" class=\"wp-caption alignright\"><img loading=\"lazy\" class=\"wp-image-16825\" src=\"http:\/\/esidesign.com\/wp-content\/uploads\/2021\/04\/IMG_5454-225x300.jpg\" alt=\"\" width=\"399\" height=\"532\" srcset=\"https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2021\/04\/IMG_5454-225x300.jpg 225w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2021\/04\/IMG_5454.jpg 724w\" sizes=\"(max-width: 399px) 100vw, 399px\" \/><figcaption id=\"caption-attachment-16825\" class=\"wp-caption-text\">A mix of remote and in-person work maximizes limited resources.<\/figcaption><\/figure>\n<h2>Once the pandemic is over and we are able to do in-person installs again, what benefits does doing a remote install have for our clients? And for the design team?<\/h2>\n<p><span style=\"font-weight: 400;\"><strong>MH<\/strong>: The biggest benefit to remote installs is allowing more client representatives to attend reviews without the need to travel. We can use the tricks and tools we learned doing it ourselves to bring in more people to a review without adding the complexity of scheduling travel and the increase in costs. This can also be true for the design team. We can have fewer designers on-site for shorter periods of time, especially for smaller projects. Also, we may be able to extend the amount of time we have for installation by performing some of the initial design and setup work remotely and finishing the details work in person without needing the extra travel budget.<\/span><\/p>\n<h2>Tell us more! Walk us through the remote install process of a specific project?<\/h2>\n<p><span style=\"font-weight: 400;\"><strong>MH<\/strong>: For a project we are installing in Chicago, we set up two camera streams and worked with a lighting designer who was on-site. We found that color, saturation and time-of-day influenced which camera was more accurate to the eye and relied on the lighting designer to let us, and the client during reviews, know which camera to look at. Recordings were made after each note session and during each review. This allowed the team to review the work that was done and have notes ready for the next review session. This also allowed clients to send accurate notes, as well as share with partners who weren’t able to make the live review.<\/span><\/p>\n<h2>Through trial and error, have you found any remote install best practices?<\/h2>\n<p><span style=\"font-weight: 400;\"><strong>MH<\/strong>: I have two big recommendations if you are going to do this yourself or if you are working with a firm who is doing this for you:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Make sure you take high quality recordings. <\/b><span style=\"font-weight: 400;\">Streaming is great for live updates and edits but the recordings give you a better sense of the quality. These can also be annotated and shared with the client which can make the review process easier.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Prioritize camera calibration. <\/b><span style=\"font-weight: 400;\">Making sure the camera represents what the eye sees (and not necessarily what looks good on camera) is important for making sure the work you’re doing is true to reality. This is also helpful when someone onsite has a concern, the more accurate your camera is the better you can understand and speak to what they are seeing.<\/span><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Interested in learning more about our work designing and installing epic-scale media installations?<\/h2>\n<p><span style=\"font-weight: 400;\"><a href=\"mailto:info@esidesign.com\">Get in touch<\/a> with our team.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Installing digital media installations as part of epic-scale experience design activations—from exhibits in an immersive, interactive museum to an eight-story digital artwork— usually requires being on-site to make sure the software and media content is installed correctly and meets the design vision and client expectations. However, during the COVID-19 pandemic our multidisciplinary team adapted to &hellip; <a href=\"https:\/\/esidesign.nbbj.com\/installing-digital-media-installations-remotely\/\">Continued<\/a><\/p>\n","protected":false},"author":6,"featured_media":7228,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[719,785,791,720,792],"_links":{"self":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/posts\/16811"}],"collection":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/comments?post=16811"}],"version-history":[{"count":0,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/posts\/16811\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/media\/7228"}],"wp:attachment":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/media?parent=16811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/categories?post=16811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/tags?post=16811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}