{"id":7565,"date":"2016-10-27T11:16:50","date_gmt":"2016-10-27T11:16:50","guid":{"rendered":"http:\/\/www.esidesign.com\/?p=7565"},"modified":"2021-01-14T10:46:52","modified_gmt":"2021-01-14T15:46:52","slug":"elegant-new-york-lobby-update-with-data-visualizations","status":"publish","type":"post","link":"https:\/\/esidesign.nbbj.com\/elegant-new-york-lobby-update-with-data-visualizations\/","title":{"rendered":"Elegant New York Lobby Update with Data Visualizations"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7547\" src=\"http:\/\/esidesign.com\/wp-content\/uploads\/2016\/10\/575-FIfth-ESI-Design-Beacon-Capital-Media-Architecture-LED-Lobby-Experience-Design-8.jpg\" alt=\"575-fifth-esi-design-beacon-capital-media-architecture-led-lobby-experience-design-8\" width=\"1000\" height=\"568\" srcset=\"https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2016\/10\/575-FIfth-ESI-Design-Beacon-Capital-Media-Architecture-LED-Lobby-Experience-Design-8.jpg 1000w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2016\/10\/575-FIfth-ESI-Design-Beacon-Capital-Media-Architecture-LED-Lobby-Experience-Design-8-300x170.jpg 300w, https:\/\/esidesign.nbbj.com\/wp-content\/uploads\/2016\/10\/575-FIfth-ESI-Design-Beacon-Capital-Media-Architecture-LED-Lobby-Experience-Design-8-768x436.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p>Earlier this month we unveiled a new project in New York City; 575 Fifth Avenue, the latest work in our long term partnership with <a href=\"http:\/\/www.beaconcapital.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Beacon Capital Partners<\/a>. As design lead for this project, I worked with a multidisciplinary team of designers from ESI Design for just under 12 months, from concept design to installation to give the former L’Oreal headquarters a makeover. Let’s take a look at what we achieved.<\/p>\n<h2>High Tech, Elegant Digital Media Installation<\/h2>\n<p>Using elegant design, high-end materials, and a data-driven digital media installation, we brought the energy and grandeur of New York City inside the lobby of 575 Fifth. The new lobby’s centerpiece is a 192-square-foot ribbon of dynamic media that wraps around walls and columns, enveloping people as they pass through the space. The design slices through the lobby walls into the chaos of midtown, offering a unexpected perspective that choreographs it into a cinematic dance of activity and culture.<br \/>\n<img loading=\"lazy\" class=\"aligncenter size-full wp-image-7545\" src=\"http:\/\/www.esidesign.com\/wp-content\/uploads\/2016\/10\/575-FIfth-ESI-Design-Beacon-Capital-Media-Architecture-LED-Lobby-Experience-Design-4.jpg\" alt=\"575-fifth-esi-design-beacon-capital-media-architecture-led-lobby-experience-design-4\" width=\"1000\" height=\"568\" \/><\/p>\n<h2>Custom Footage Paired with Data Visualization<\/h2>\n<p>The media content playing on the LED screens centers on beautiful, cinematic videos.  The way they play across the ribbon of monitors on the walls and columns has an immersive ‘all around you’ effect. The vignettes were commissioned specifically for the project, and some footage was taken from the building itself (including some we shot from the roof looking straight down) and its surrounding streets. The media creates what I like to call ‘meditative moments’, playing footage of green spaces, buildings and people within the city, all filmed at unique angles with the pace slowed down, to create a cool energy in the lobby.<\/p>\n<p>Throughout the day, infographic moments are composited over the slow motion video. These moments come in informative modes driven by data feeds and pre-rendered media to ensure that it stays dynamic and interesting for tenants who see it multiple times a day. The media modes include:<\/p>\n<ul>\n<li>MARKET WATCH, in which endless squares that make up midtown Manhattan skyline illuminate to create a graph of the last 5 days of the Dow Jones s&amp;p 500. (pictured above)<\/li>\n<li>LOCAL EVENTS, which features photos from top New York City cultural destinations and updates tenants with information about cultural events and other local happenings.<\/li>\n<li>NEWS, in which current headlines from international news sources trail behind the crowds of people walking along 5<sup>th<\/sup> avenue seen from birds-eye view. Subtle wordclouds form on each column featuring trending topics of the moment.<\/li>\n<li>WEATHER, which displays hourly and four-day forecasts for the local area accompanied by videos of pedestrians in various weather conditions that take on the hue of that day’s actual weather. An information layer is blown across the screen according to the direction and speed of the wind.<\/li>\n<li>575 FIFTH, the building ID, in which the screens camouflage themselves into the surrounding textured marble walls, then come alive with the building logo.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7544\" src=\"http:\/\/www.esidesign.com\/wp-content\/uploads\/2016\/10\/575-FIfth-ESI-Design-Beacon-Capital-Media-Architecture-LED-Lobby-Experience-Design-3.jpg\" alt=\"575-fifth-esi-design-beacon-capital-media-architecture-led-lobby-experience-design-3\" width=\"1000\" height=\"568\" \/><\/p>\n<h2>Fitting LED into the Surfaces for a Seamless and Immersive Design<\/h2>\n<p>One of the most astonishing things about the LED installation in the lobby at 575 Fifth is its seamless integration with the space. The horizontal slice of media screens appears flush with the marble walls and columns. This was no easy feat for the team. To achieve the 90-degree media wraparounds, the LEDs and the stone and metal work that surround them, had to be perfectly straight. ESI worked closely with our construction partners to ensure the finish around the displays was crisp, with only a 5mm gap, while also allowing for the technical requirements of the LEDs – power, ventilation, and access for maintenance.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7543\" src=\"http:\/\/www.esidesign.com\/wp-content\/uploads\/2016\/10\/575-FIfth-ESI-Design-Beacon-Capital-Media-Architecture-LED-Lobby-Experience-Design-2.jpg\" alt=\"575-fifth-esi-design-beacon-capital-media-architecture-led-lobby-experience-design-2\" width=\"1000\" height=\"568\" \/><\/p>\n<h2>Exterior and Interior Updates Changed the Story of the Building<\/h2>\n<p>The transformation of 575 Fifth Avenue is symbolic of the fast-evolving neighborhood, leading a hectic section of midtown Manhattan on its way to becoming more refined and professional, and attracting a wider range of tenants. Because of this, a holistic design approach was needed to reimagine the lobby and branding in a cohesive way, and for the new identity of the building to match the exuberance of the surrounding neighborhood.<\/p>\n<p>The design of the informative media band works harmoniously with the new textured marble wall treatments, their elongated horizontal nature mimicking each other. We also added sleek, modern furniture and positioned it to hug the wall, creating openness for people to pass through the lobby easily and for everyone to have clear views of the media.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7568\" src=\"http:\/\/www.esidesign.com\/wp-content\/uploads\/2016\/10\/575-Fifth-CA-Type-Award-Submission-01.jpg\" alt=\"575-fifth-ca-type-award-submission-01\" width=\"1024\" height=\"768\" \/><\/p>\n<p>The new building logo, brand identity, and font set was also part of the unified design approach, complementing 575 Fifth’s sleek, contemporary feel. The logo echoes the band of LED displays in the physical space with the horizontal ‘cut’ implying rising motion, and is used within the digital media and on the building itself.<\/p>\n<h2>Working Together to Add Value to Workplace Experiences<\/h2>\n<p>Though it’s just one of our many collaborations with Beacon Capital Partners, we’re proud of our work at 575 Fifth adding a high-tech lobby and branding makeover for the building’s tenants.<\/p>\n<blockquote><p>“Beacon focuses on creating and adding value to office buildings by providing tenants the state-of-the-art infrastructure and amenities they require, as well as visual interest and distinct design they can be proud of.”<br \/>\n&#8211; Chris Gulden, Senior Vice President, Beacon Capital Partners<\/p><\/blockquote>\n<h2>Want to See More Digital Media Installations?<\/h2>\n<p>Stop by 575 Fifth Ave when you are next in New York City to see it in person, or take a look online at other lobby installations featuring digital media, such as <a href=\"http:\/\/www.esidesign.com\/work\/1cal-plaza-los-angeles\" target=\"_blank\" rel=\"noopener noreferrer\">1CAL Plaza<\/a> in Los Angeles, CA and <a href=\"http:\/\/www.esidesign.com\/work\/221-main-street-san-francisco\" target=\"_blank\" rel=\"noopener noreferrer\">221 Main Street<\/a> in San Francisco, CA.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Earlier this month we unveiled a new project in New York City; 575 Fifth Avenue, the latest work in our long term partnership with Beacon Capital Partners. As design lead for this project, I worked with a multidisciplinary team of designers from ESI Design for just under 12 months, from concept design to installation to &hellip; <a href=\"https:\/\/esidesign.nbbj.com\/elegant-new-york-lobby-update-with-data-visualizations\/\">Continued<\/a><\/p>\n","protected":false},"author":17,"featured_media":7547,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[441,186,442,485,443,188,31,32,74,444,262,6,190,445,65,447],"_links":{"self":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/posts\/7565"}],"collection":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/comments?post=7565"}],"version-history":[{"count":0,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/posts\/7565\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/media\/7547"}],"wp:attachment":[{"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/media?parent=7565"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/categories?post=7565"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/esidesign.nbbj.com\/wp-json\/wp\/v2\/tags?post=7565"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}